src/Reports/ДонесениеОКоличествеГражданПребывающихВЗапасе/ДонесениеОКоличествеГражданПребывающихВЗапасе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДонесениеОКоличествеГражданПребывающихВЗапасе</name>
  <attributes>
    <name>ПараметрОтбора</name>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ВоинскийУчет/ВоинскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВоинскийУчет</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ОтношениеКВоинскойОбязанности</name>
    <type>
      <types>EnumRef.ОтношениеКВоинскойОбязанности</types>
    </type>
  </resources>
  <resources>
    <name>ОтношениеКВоинскомуУчету</name>
    <type>
      <types>EnumRef.ОтношениеКВоинскомуУчету</types>
    </type>
  </resources>
  <resources>
    <name>Звание</name>
    <type>
      <types>CatalogRef.ВоинскиеЗвания</types>
    </type>
  </resources>
  <resources>
    <name>ВУС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Годность</name>
    <type>
      <types>EnumRef.ГодностьКВоеннойСлужбе</types>
    </type>
  </resources>
  <resources>
    <name>Военкомат</name>
    <type>
      <types>CatalogRef.Военкоматы</types>
    </type>
  </resources>
  <resources>
    <name>НаличиеМобпредписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗабронированОрганизацией</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ОснованиеНегодности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпецУчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Группа</name>
    <type>
      <types>EnumRef.ГруппыВоинскогоУчета</types>
    </type>
  </resources>
  <resources>
    <name>Категория</name>
    <type>
      <types>EnumRef.КатегорииВоинскогоУчета</types>
    </type>
  </resources>
  <resources>
    <name>Профиль</name>
    <type>
      <types>EnumRef.ПрофилиОфицеров</types>
    </type>
  </resources>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СоставыВоеннослужащих/СоставыВоеннослужащих.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СоставыВоеннослужащих</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Рядовой</name>
  </enumValues>
  <enumValues>
    <name>СержантскийИСтаршинский</name>
  </enumValues>
  <enumValues>
    <name>ПрапорщиковИМичманов</name>
  </enumValues>
  <enumValues>
    <name>МладшиеОфицеры</name>
  </enumValues>
  <enumValues>
    <name>СтаршиеОфицеры</name>
  </enumValues>
  <enumValues>
    <name>ВысшиеОфицеры</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ОтношениеКВоинскойОбязанности/ОтношениеКВоинскойОбязанности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтношениеКВоинскойОбязанности</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Военнообязанный</name>
  </enumValues>
  <enumValues>
    <name>НеВоеннообязанный</name>
  </enumValues>
  <enumValues>
    <name>Призывник</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ГодностьКВоеннойСлужбе/ГодностьКВоеннойСлужбе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГодностьКВоеннойСлужбе</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Годен</name>
  </enumValues>
  <enumValues>
    <name>НеГоден</name>
  </enumValues>
  <enumValues>
    <name>ГоденКНестроевой</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СостоянияРаботникаОрганизации/СостоянияРаботникаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияРаботникаОрганизации</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Работает</name>
  </enumValues>
  <enumValues>
    <name>НеРаботает</name>
  </enumValues>
  <enumValues>
    <name>Заболевание</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ОтпускЕжегодный</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебный</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезСохраненияЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствуетПоНевыясненнойПричине</name>
  </enumValues>
  <enumValues>
    <name>ВынужденныйПрогул</name>
  </enumValues>
  <enumValues>
    <name>ГосударственныеОбязанности</name>
  </enumValues>
  <enumValues>
    <name>Прогулы</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниОплачиваемые</name>
  </enumValues>
  <enumValues>
    <name>Простой</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыЗанятостиВОрганизации/ВидыЗанятостиВОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗанятостиВОрганизации</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееСовместительство</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/КатегорииДолжностей/КатегорииДолжностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииДолжностей</name>
  <predefined>
    <items>
      <name>ДругиеСлужащие</name>
      <description>Другие служащие</description>
    </items>
    <items>
      <name>Рабочие</name>
      <description>Рабочие</description>
    </items>
    <items>
      <name>Руководители</name>
      <description>Руководители</description>
    </items>
    <items>
      <name>Специалисты</name>
      <description>Специалисты</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/Reports/ДонесениеОКоличествеГражданПребывающихВЗапасе/ObjectModule.bsl
#Если Клиент Тогда

/////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//	ЕстьОшибки - флаг того, что при формировании произошли ошибки
//
Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки) Экспорт

    Если ТипЗнч(ПараметрОтбора) = Тип("СправочникСсылка.Организации") Тогда 
		Организация = ПараметрОтбора;
	Иначе
		ЕстьОшибки = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	  
    СписокОфицерскогоСостава	=	Новый СписокЗначений;
	СписокОфицерскогоСостава.Добавить(Перечисления.СоставыВоеннослужащих.МладшиеОфицеры);
	СписокОфицерскогоСостава.Добавить(Перечисления.СоставыВоеннослужащих.СтаршиеОфицеры);
	СписокОфицерскогоСостава.Добавить(Перечисления.СоставыВоеннослужащих.ВысшиеОфицеры);
	
	СписокСоставаСержантовИПрапорщиков	=	Новый СписокЗначений;
	СписокСоставаСержантовИПрапорщиков.Добавить(Перечисления.СоставыВоеннослужащих.СержантскийИСтаршинский);
	СписокСоставаСержантовИПрапорщиков.Добавить(Перечисления.СоставыВоеннослужащих.ПрапорщиковИМичманов);
	
	СписокСолдатскогоСостава			=	Новый СписокЗначений;
	СписокСолдатскогоСостава.Добавить(Перечисления.СоставыВоеннослужащих.Рядовой);	
	
	Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаАктуальности);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Офицеры",			СписокОфицерскогоСостава);
	Запрос.УстановитьПараметр("Прапорщики",			СписокСоставаСержантовИПрапорщиков);
	Запрос.УстановитьПараметр("Солдаты",			СписокСолдатскогоСостава);
	Запрос.УстановитьПараметр("Военнообязанный",	Перечисления.ОтношениеКВоинскойОбязанности.Военнообязанный);
	Запрос.УстановитьПараметр("ОграниченноГоден",	Перечисления.ГодностьКВоеннойСлужбе.ГоденКНестроевой);
	Запрос.УстановитьПараметр("До30лет",			ДобавитьМесяц(ДатаАктуальности, -12*30));
	Запрос.УстановитьПараметр("До35лет",			ДобавитьМесяц(ДатаАктуальности, -12*35));
	Запрос.УстановитьПараметр("До40лет",			ДобавитьМесяц(ДатаАктуальности, -12*40));
	Запрос.УстановитьПараметр("До45лет",			ДобавитьМесяц(ДатаАктуальности, -12*45));
	Запрос.УстановитьПараметр("До50лет",			ДобавитьМесяц(ДатаАктуальности, -12*50));
	Запрос.УстановитьПараметр("Призывник",			Перечисления.ОтношениеКВоинскойОбязанности.Призывник);
	Запрос.УстановитьПараметр("НеРаботает",			Перечисления.СостоянияРаботникаОрганизации.НеРаботает);
	Запрос.УстановитьПараметр("Руководители",		Справочники.КатегорииДолжностей.Руководители);
	Запрос.УстановитьПараметр("Специалисты",		Справочники.КатегорииДолжностей.Специалисты);
	Запрос.УстановитьПараметр("ДругиеСлужащие",		Справочники.КатегорииДолжностей.ДругиеСлужащие);
	Запрос.УстановитьПараметр("Рабочие",			Справочники.КатегорииДолжностей.Рабочие);
	Запрос.УстановитьПараметр("ВидЗанятостиОсновноеМестоРаботы", Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы);

	ТекстОсновногоЗапроса ="ВЫБРАТЬ
	              |	РаботникиОрганизации.Должность.Категория КАК ДолжностьКатегория,
	              |	1 КАК ВсегоРаботающих,
	              |	ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ВсегоВЗапасе,
	              |	ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.Звание.Состав В (&Офицеры) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ОфицеровВЗапасе,
	              |	ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.Звание.Состав В (&Прапорщики) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ПрапорщиковВЗапасе,
	              |	ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.Звание.Состав В (&Солдаты) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК СолдатВЗапасе,
	              |	ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.Годность = &ОграниченноГоден ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ПрапорщиковСолдатОграниченноГодныхВЗапасе,
	              |	ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ВсегоВЗапасеЗабронировано,
	              |	ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.Звание.Состав В (&Офицеры) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ОфицеровЗабронировано,
	              |	ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (ВУ.Звание.Состав В (&Прапорщики) ИЛИ ВУ.Звание.Состав В (&Солдаты)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До30лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ПрапорщиковСолдатДо30Забронировано,
	              |	ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (ВУ.Звание.Состав В (&Прапорщики) ИЛИ ВУ.Звание.Состав В (&Солдаты)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До35лет И РаботникиОрганизации.ФизЛицо.ДатаРождения <= &До30лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ПрапорщиковСолдатОт31До35Забронировано,
	              |	ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (ВУ.Звание.Состав В (&Прапорщики) ИЛИ ВУ.Звание.Состав В (&Солдаты)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До40лет И РаботникиОрганизации.ФизЛицо.ДатаРождения <= &До35лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ПрапорщиковСолдатОт36До40Забронировано,
	              |	ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (ВУ.Звание.Состав В (&Прапорщики) ИЛИ ВУ.Звание.Состав В (&Солдаты)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До45лет И РаботникиОрганизации.ФизЛицо.ДатаРождения <= &До40лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ПрапорщиковСолдатОт41До45Забронировано,
	              |	ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (ВУ.Звание.Состав В (&Прапорщики) ИЛИ ВУ.Звание.Состав В (&Солдаты)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До50лет И РаботникиОрганизации.ФизЛицо.ДатаРождения <= &До45лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК ПрапорщиковСолдатОт46До50Забронировано,
	              |	ВЫБОР КОГДА НЕ(ВУ.ЗабронированОрганизацией = &Организация) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И НЕ(ВУ.НаличиеМобпредписания) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК НезабронированноБезМобпредписаний,
	              |	ВЫБОР КОГДА НЕ(ВУ.ЗабронированОрганизацией = &Организация) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.НаличиеМобпредписания ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК НезабронированноСМобпредписанием,
	              |	ВЫБОР КОГДА НЕ(ВУ.ЗабронированОрганизацией = &Организация) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.НаличиеМобпредписания И ВУ.Звание.Состав В (&Офицеры) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК НезабронированноОфицеровСМобпредписанием,
	              |	ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Призывник ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК Призывников,
				  |	ВЫБОР КОГДА РаботникиОрганизации.Должность.Категория = &Руководители ТОГДА 1 КОГДА РаботникиОрганизации.Должность.Категория = &Специалисты ТОГДА 2 КОГДА РаботникиОрганизации.Должность.Категория = &ДругиеСлужащие ТОГДА 11 КОГДА РаботникиОрганизации.Должность.Категория = &Рабочие ТОГДА 12 ИНАЧЕ РаботникиОрганизации.Должность.Категория.Код КОНЕЦ КАК НомерСтрокиПП
	              |ИЗ
	              |	(ВЫБРАТЬ
	              |		РаботникиОрганизацииСрезПоследних.Должность КАК Должность,
	              |		РаботникиОрганизацииСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо
				  |	ИЗ
	              |		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности,Сотрудник.ВидЗанятости = &ВидЗанятостиОсновноеМестоРаботы) КАК РаботникиОрганизацииСрезПоследних
	              |	
	              |	ГДЕ
	              |		РаботникиОрганизацииСрезПоследних.Организация = &Организация И
	              |		(РаботникиОрганизацииСрезПоследних.ЗанимаемыхСтавок > 0)) КАК РаботникиОрганизации
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&ДатаАктуальности, ) КАК ВУ
	              |		ПО РаботникиОрганизации.ФизЛицо = ВУ.Физлицо
				  |УПОРЯДОЧИТЬ ПО
	              |	НомерСтрокиПП
				  |
	              |ИТОГИ СУММА(ВсегоРаботающих), СУММА(ВсегоВЗапасе), СУММА(ОфицеровВЗапасе), СУММА(ПрапорщиковВЗапасе), СУММА(СолдатВЗапасе), СУММА(ПрапорщиковСолдатОграниченноГодныхВЗапасе), СУММА(ВсегоВЗапасеЗабронировано), СУММА(ОфицеровЗабронировано), СУММА(ПрапорщиковСолдатДо30Забронировано), СУММА(ПрапорщиковСолдатОт31До35Забронировано), СУММА(ПрапорщиковСолдатОт36До40Забронировано), СУММА(ПрапорщиковСолдатОт41До45Забронировано), СУММА(ПрапорщиковСолдатОт46До50Забронировано), СУММА(НезабронированноБезМобпредписаний), СУММА(НезабронированноСМобпредписанием), СУММА(НезабронированноОфицеровСМобпредписанием), СУММА(Призывников) ПО
	              |	ОБЩИЕ,
	              |	ДолжностьКатегория";
				  
	ДокументРезультат.Очистить();
	Макет 			= ПолучитьМакет("Форма");
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.НаДату				= "По состоянию на " + Формат(ДатаАктуальности, "ДЛФ=DD");
	ОбластьШапка.Параметры.Организация			= "по " + Организация.Наименование;
	ДокументРезультат.Присоединить(ОбластьШапка);

		Запрос.Текст = ТекстОсновногоЗапроса;
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка	=	РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() тогда
			ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.ВсегоРаботающих									= Выборка.ВсегоРаботающих;
			ОбластьСтрока.Параметры.ВсегоВЗапасе 									= Выборка.ВсегоВЗапасе;
			ОбластьСтрока.Параметры.ОфицеровВЗапасе 								= Выборка.ОфицеровВЗапасе;
			ОбластьСтрока.Параметры.ВсегоВЗапасеЗабронировано 						= Выборка.ВсегоВЗапасеЗабронировано;
			ОбластьСтрока.Параметры.ОфицеровЗабронировано 							= Выборка.ОфицеровЗабронировано;
			Если Выборка.ВсегоВЗапасе <> 0 тогда
				ОбластьСтрока.Параметры.ЗабронированоПроцент				= (Выборка.ВсегоВЗапасеЗабронировано / Выборка.ВсегоВЗапасе)*100;
				ОбластьСтрока.Параметры.НезабронированноСМобпредписаниемПроцент	= (Выборка.НезабронированноСМобпредписанием / Выборка.ВсегоВЗапасе)*100;
			КонецЕсли;
    		ОбластьСтрока.Параметры.НезабронированноСМобпредписанием 				= Выборка.НезабронированноСМобпредписанием;
			ОбластьСтрока.Параметры.НезабронированноОфицеровСМобпредписанием		= Выборка.НезабронированноОфицеровСМобпредписанием;
			ОбластьСтрока.Параметры.Призывников										= Выборка.Призывников;
			ДокументРезультат.Присоединить(ОбластьСтрока);
			ОбластьПодвал	=	Макет.ПолучитьОбласть("Подвал");

			ОтветственныеЛицаОрганизации	=	РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация,ДатаАктуальности);
			ОбластьПодвал.Параметры.ДолжностьРуководителя	=	ОтветственныеЛицаОрганизации.РуководительДолжность;
			ОбластьПодвал.Параметры.ФИОРуководителя			=	ОтветственныеЛицаОрганизации.Руководитель;
		КонецЕсли;

	Если ТипЗнч(ОбластьПодвал)	=	Тип("ТабличныйДокумент")	тогда
		ДокументРезультат.Присоединить(ОбластьПодвал);
	КонецЕсли;
	
	//Параметры документа
	ДокументРезультат.Автомасштаб 			= Истина;
	ДокументРезультат.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.Защита              	= Ложь;
	
КонецПроцедуры

#КонецЕсли
